publications.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 24 December 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org0de43c3" class="outline-2">
<h2 id="org0de43c3">Peer-Reviewed Conference and Workshop Papers</h2>
<div class="outline-text-2" id="text-org0de43c3">
</div>
<ul class="org-ul">
<li><a id="org957b1d8"></a>2023<br>
<ul class="org-ul">
<li><a id="orgb0f99ab"></a><a href="pubs/stretching_ghc.pdf">Stretching the Glasgow Haskell Compiler: Nourishing GHC with Domain-Driven Design</a><br>
<div class="outline-text-4" id="text-orgb0f99ab">
<p>
Authors: Jeffrey M. Young, Sylvain Henry, John Ericson<br>
Conference: <i>1st ACM SIGPLAN International Workshop on Functional Software Architecture. (FUNARCH), 2023</i><br>
</p>
</div>
</li>
</ul>
</li>

<li><a id="org4bda1d2"></a>2020<br>
<ul class="org-ul">
<li><a id="org4784c1e"></a><a href="pubs/vsat.pdf">Variational Satisfiability Solving</a><br>
<div class="outline-text-4" id="text-org4784c1e">
<p>
Authors: Jeffrey M. Young, Eric Walkingshaw, Thomas Thüm<br>
Conference: <i>ACM Int. Systems and Software Product Line Conf. (SPLC), 2020</i><br>
Data: <a href="https://github.com/lambda-land/VSat-Papers/tree/master/SPLC2020">on github</a><br>
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgab8fae5"></a>2018<br>
<ul class="org-ul">
<li><a id="orgb499440"></a><a href="pubs/sigcse18-algorithm-explanations.pdf">A Domain Analysis of Data Structure and Algorithm Explanations in the Wild</a><br>
<div class="outline-text-4" id="text-orgb499440">
<p>
Authors: Jeffrey M. Young and Eric Walkingshaw<br>
Conference: <i>ACM SIGCSE Technical Symp. on Computer Science Education (SIGCSE), 2018, 870–875</i><br>
Data: <a href="https://github.com/lambda-land/XOP-Algorithms-Data">on github</a><br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org46b6bf4" class="outline-2">
<h2 id="org46b6bf4">Journal Articles</h2>
<div class="outline-text-2" id="text-org46b6bf4">
</div>
<ul class="org-ul">
<li><a id="org4c340dc"></a>2022<br>
<ul class="org-ul">
<li><a id="org635444a"></a>Variational Satisfiability Solving: Solving Lots of Related SAT Problems<br>
<div class="outline-text-4" id="text-org635444a">
<p>
Authors: Jeffrey M. Young, Paul Maximilian Bittner, Eric Walkingshaw,<br>
Thomas Thüm<br>
Journal: <i>Empirical Software Engineering (<a href="https://emsejournal.github.io/">EMSE</a>)</i><br>
Publisher: Springer<br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org4288615" class="outline-2">
<h2 id="org4288615">Theses and Other Papers</h2>
<div class="outline-text-2" id="text-org4288615">
</div>
<ul class="org-ul">
<li><a id="org1adc545"></a>2022<br>
<ul class="org-ul">
<li><a id="org08f6d41"></a>White Paper: <a href="https://hsyl20.fr/home/files/papers/2022-ghc-modularity.pdf">Modularizing GHC</a><br>
<div class="outline-text-4" id="text-org08f6d41">
<p>
Authors: Sylvain Henry, John Ericson, Jeffery M. Young<br>
</p>
</div>
</li>
</ul>
</li>

<li><a id="orge1a3cd7"></a>2021<br>
<ul class="org-ul">
<li><a id="org1f63be7"></a><a href="https://ir.library.oregonstate.edu/concern/graduate_thesis_or_dissertations/dv140182g">PhD Thesis: Variational Satisfiability Solving</a><br>
<div class="outline-text-4" id="text-org1f63be7">
<p>
Authors: Jeffrey M. Young<br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orga31ea17" class="outline-2">
<h2 id="orga31ea17">Books</h2>
<div class="outline-text-2" id="text-orga31ea17">
</div>
<ul class="org-ul">
<li><a id="orgcc41924"></a>2022<br>
<ul class="org-ul">
<li><a id="org1722918"></a><a href="https://github.com/input-output-hk/hs-opt-handbook.github.io">Haskell Optimization Handbook</a><br>
<div class="outline-text-4" id="text-org1722918">
<p>
Still in progress. Still much to write.<br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org6aa87d7" class="outline-2">
<h2 id="org6aa87d7">Talks</h2>
<div class="outline-text-2" id="text-org6aa87d7">
</div>
<ul class="org-ul">
<li><a id="org12a9bd3"></a>2025<br>
<ul class="org-ul">
<li><a id="org54a458a"></a><a href="https://www.youtube.com/live/FB0CS0X1QRc?si=1u_DEOrXryQOoh4R&amp;t=26177">What is Functional Architecture</a><br>
<div class="outline-text-4" id="text-org54a458a">
<p>
Conference: <i>FUNARCH 2025</i><br>
</p>
</div>
</li>

<li><a id="orgbe564f7"></a><a href="https://www.youtube.com/live/FB0CS0X1QRc?si=-Aoa5WxZILYGaKB0&amp;t=27678">Future of FUNARCH</a><br>
<div class="outline-text-4" id="text-orgbe564f7">
<p>
Conference: <i>FUNARCH 2025</i><br>
</p>
</div>
</li>
</ul>
</li>

<li><a id="org4568507"></a>2022<br>
<ul class="org-ul">
<li><a id="org129cadb"></a><a href="https://github.com/input-output-hk/hs-opt-handbook.github.io">The Haskell Optimization Handbook</a><br>
<div class="outline-text-4" id="text-org129cadb">
<p>
Conference: <i>Haskell Implementors Workshop, (HiW), 2022</i><br>
</p>
</div>
</li>
</ul>
</li>

<li><a id="org394d7bd"></a>2021<br>
<ul class="org-ul">
<li><a id="orgabb6ded"></a><a href="https://youtu.be/dFDTzYsXu6c">Adventures in GHC Compile Times</a><br>
<div class="outline-text-4" id="text-orgabb6ded">
<p>
Conference: <i>Haskell Implementors Workshop, (HiW), 2021</i><br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgf7a6035" class="outline-2">
<h2 id="orgf7a6035">Service</h2>
<div class="outline-text-2" id="text-orgf7a6035">
</div>
<ul class="org-ul">
<li><a id="org2661389"></a>2025<br>
<ul class="org-ul">
<li><a id="orge8c148e"></a><a href="https://dl.acm.org/doi/proceedings/10.1145/3759163">Program Chair</a><br>
<div class="outline-text-4" id="text-orge8c148e">
<p>
Conference: <i>3rd ACM SIGPLAN International Workshop on Functional Software Architecture. (FUNARCH), 2025</i><br>
</p>
</div>
</li>

<li><a id="org2d8c702"></a><a href="https://github.com/haskell/core-libraries-committee">Haskell Core Library Committee Member</a><br></li>
</ul>
</li>


<li><a id="org817d437"></a>2024<br>
<ul class="org-ul">
<li><a id="orgc390a08"></a><a href="https://dl.acm.org/doi/proceedings/10.1145/3677998">Program Committee</a><br>
<div class="outline-text-4" id="text-orgc390a08">
<p>
Conference: <i>2nd ACM SIGPLAN International Workshop on Functional Software Architecture. (FUNARCH), 2024</i><br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<hr>
       <div class="botnav" style="text-align:center; margin-top: 1em;">
          <a href='/index.html'>Blog</a>
          <a href='/publications.html'>Publications</a>
          <a href='https://github.com/doyougnu'>Github</a>
          <a href='/me.html'>About</a>
        </div> 
</div>
</body>
</html>
